RT-Thread/rt-thread/bsp/nxp/imx/imxrt/imxrt1180-nxp-evk/cm7/board/MCUX_Config/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MIMXRT1189xxxxx
package_id: MIMXRT1189CVM8C
mcu_data: ksdk2_0
processor_version: 0.15.9
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_rgpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();

#ifdef BSP_USING_ETH
    BOARD_InitPhyAccessPins();
    BOARD_InitEpPins();
    BOARD_InitSwtPort0Pins();    
#endif
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M7 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
	CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
    CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */
		
#ifdef BSP_USING_LPUART12
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AON_19_LPUART12_TX,         /* GPIO_AON_19 is configured as LPUART12_TX */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AON_20_LPUART12_RX,         /* GPIO_AON_20 is configured as LPUART12_RX */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AON_19_LPUART12_TX,         /* GPIO_AON_19 PAD functional properties : */
        0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: high driver
                                                    Pull / Keep Select Field: Pull Disable, Highz
                                                    Pull Up / Down Config. Field: Weak pull down
                                                    Open Drain Field: Disabled */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AON_20_LPUART12_RX,         /* GPIO_AON_20 PAD functional properties : */
        0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: high driver
                                                    Pull / Keep Select Field: Pull Disable, Highz
                                                    Pull Up / Down Config. Field: Weak pull down
                                                    Open Drain Field: Disabled */
#endif

#ifdef BSP_USING_I2C2
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AON_16_LPI2C2_SCL,          /* GPIO_AON_16 is configured as LPI2C2_SCL */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_AON_16 */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AON_15_LPI2C2_SDA,          /* GPIO_AON_15 is configured as LPI2C2_SDA */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_AON_15 */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AON_16_LPI2C2_SCL,          /* GPIO_AON_16 PAD functional properties : */
        0x1DU);                                 /* Slew Rate Field: Slow Slew Rate
                                                    Pull Enable Field: Pull Enable
                                                    Pull Up / Down Config. Field: Weak pull up
                                                    Open Drain Field: Enabled */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AON_15_LPI2C2_SDA,          /* GPIO_AON_15 PAD functional properties : */
        0x1DU);                                 /* Slew Rate Field: Slow Slew Rate
                                                    Pull Enable Field: Pull Enable
                                                    Pull Up / Down Config. Field: Weak pull up
                                                    Open Drain Field: Enabled */
#endif

#ifdef BSP_USING_I2C3
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AON_16_LPI2C2_SCL,          /* GPIO_AON_16 is configured as LPI2C2_SCL */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_AON_16 */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AON_15_LPI2C2_SDA,          /* GPIO_AON_15 is configured as LPI2C2_SDA */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_AON_15 */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AON_16_LPI2C2_SCL,          /* GPIO_AON_16 PAD functional properties : */
        0x1DU);                                 /* Slew Rate Field: Slow Slew Rate
                                                    Pull Enable Field: Pull Enable
                                                    Pull Up / Down Config. Field: Weak pull up
                                                    Open Drain Field: Enabled */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AON_15_LPI2C2_SDA,          /* GPIO_AON_15 PAD functional properties : */
        0x1DU);                                 /* Slew Rate Field: Slow Slew Rate
                                                    Pull Enable Field: Pull Enable
                                                    Pull Up / Down Config. Field: Weak pull up
                                                    Open Drain Field: Enabled */
#endif

